### Analytic Oriented Pandas Functions:

In [18]:
import pandas as pd

## Data Frame

1. Create a Manual Data Frame

In [19]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame
#A data frame has always an assigned

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

2. Arrane the column of the avove data frame in given order: Year> Sate> Pop and what happends in a column in not in the table

In [20]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

#If a column is not in the table. The column will appear wilth "Nan" Values

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

3. Retrieve 2nd row from table using **loc** command

In [21]:
#Pick any rows using loc with index value such as index = 1 for 2nd row

frame.loc[1]

state    Ohio
year     2001
pop       1.7
Name: 1, dtype: object

4. Add a new boolean column w.r.t to a column in table

In [22]:
frame["Boolean"] = frame["state"] == "Ohio"
frame

    state  year  pop  Boolean
0    Ohio  2000  1.5     True
1    Ohio  2001  1.7     True
2    Ohio  2002  3.6     True
3  Nevada  2001  2.4    False
4  Nevada  2002  2.9    False
5  Nevada  2003  3.2    False

5. Delete the boolean column from above table

In [23]:
del frame["Boolean"]
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

6. Craete any dummy nested dict of dicts Dataframe manually

In [24]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

7. Tranpose above data?

In [25]:
T = frame3.T
T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

8. In above table there is no name of series column. Name the index column as "State"

In [26]:
T.index.name = "State"
T

        2001  2002  2000
State
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

9. In above table there is no name of  Column Header row. Name the columns header row as "Year"

In [27]:
T.columns.name = "Year"
T

Year    2001  2002  2000
State
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

10. Create a 2D 4*4 array from value 0 to 15 and put series column on left and columns name on top to. make it look like a table.

In [28]:
import numpy as np

data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

11. In above table, Sloice data for colarado row and column two and three: Using location

In [29]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

12. Give same sort of result as above using location of rows and column instead of name using i location

In [30]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

13. What happens if we add two different data sets?

In [33]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

print(df1,"\n")
print(df2,"\n")
print(df1 + df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

14. How to check duplicacy of values in a column?

In [34]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj.index.is_unique

False

15. Apply idmax function on below df to see index of the maximum value if a column in a table

In [35]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])
df1["c"].idxmax()

'Colorado'

16. Use Cum sum function to see column vise cummulative count.

In [36]:
df1.cumsum()

            b     c     d
Ohio      0.0   1.0   2.0
Texas     3.0   5.0   7.0
Colorado  9.0  12.0  15.0

17. Install a panda reader library to read online data, and create a data set

In [37]:
import pandas_datareader.data as web

all_data = {ticker: web.get_data_yahoo(ticker)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

all_data

#Below data has 5 columns for each of four comanies: 'AAPL', 'IBM', 'MSFT', 'GOOG'

{'AAPL':                   High         Low        Open       Close       Volume  \
 Date
 2017-02-02   32.347500   31.945000   31.995001   32.132500  134841600.0
 2017-02-03   32.297501   32.040001   32.077499   32.270000   98029200.0
 2017-02-06   32.625000   32.224998   32.282501   32.572498  107383600.0
 2017-02-07   33.022499   32.612499   32.634998   32.882500  152735200.0
 2017-02-08   33.055000   32.805000   32.837502   33.009998   92016400.0
 ...                ...         ...         ...         ...          ...
 2022-01-26  164.389999  157.820007  163.500000  159.690002  108275300.0
 2022-01-27  163.839996  158.279999  162.449997  159.220001  121954600.0
 2022-01-28  170.350006  162.800003  165.710007  170.330002  179935700.0
 2022-01-31  175.000000  169.509995  170.160004  174.779999  115541600.0
 2022-02-01  174.820007  172.320007  174.009995  174.610001   79067749.0

              Adj Close
 Date
 2017-02-02   30.245739
 2017-02-03   30.375162
 2017-02-06   30.659901
 2017-02-07   30.951696
 2017-02-08   31.071707
 ...                ...
 2022-01-26  159.690002
 2022-01-27  159.220001
 2022-01-28  170.330002
 2022-01-31  174.779999
 2022-02-01  174.610001

 [1259 rows x 6 columns],
 'IBM':                   High         Low        Open       Close     Volume  \
 Date
 2017-02-02  167.275330  165.917786  166.567871  166.902481  2741043.0
 2017-02-03  168.585083  167.198853  167.304016  168.087952  3461528.0
 2017-02-06  168.240921  166.711288  167.600388  168.126190  2772737.0
 2017-02-07  170.764816  168.164429  168.260040  170.611862  4051681.0
 2017-02-08  169.694077  168.145309  169.694077  168.422562  3047103.0
 ...                ...         ...         ...         ...        ...
 2022-01-26  137.070007  133.130005  136.470001  134.259995  8336000.0
 2022-01-27  134.750000  132.080002  133.660004  132.520004  5497300.0
 2022-01-28  134.529999  131.789993  133.190002  134.500000  5471500.0
 2022-01-31  134.089996  132.300003  134.089996  133.570007  5859000.0
 2022-02-01  135.960007  132.500000  133.759995  135.529999  5991906.0

              Adj Close
 Date
 2017-02-02  132.696701
 2017-02-03  133.639221
 2017-02-06  133.669617
 2017-02-07  135.645874
 2017-02-08  134.964035
 ...                ...
 2022-01-26  134.259995
 2022-01-27  132.520004
 2022-01-28  134.500000
 2022-01-31  133.570007
 2022-02-01  135.529999

 [1259 rows x 6 columns],
 'MSFT':                   High         Low        Open       Close      Volume  \
 Date
 2017-02-02   63.410000   62.750000   63.250000   63.169998  45827000.0
 2017-02-03   63.700001   63.070000   63.500000   63.680000  30301800.0
 2017-02-06   63.650002   63.139999   63.500000   63.639999  19796400.0
 2017-02-07   63.779999   63.230000   63.740002   63.430000  20277200.0
 2017-02-08   63.810001   63.220001   63.570000   63.340000  18096400.0
 ...                ...         ...         ...         ...         ...
 2022-01-26  308.500000  293.029999  307.989990  296.709991  90428900.0
 2022-01-27  307.299988  297.929993  302.660004  299.839996  53481300.0
 2022-01-28  308.480011  294.450012  300.230011  308.260010  49743700.0
 2022-01-31  312.380005  306.369995  308.950012  310.980011  46444500.0
 2022-02-01  310.600006  305.129303  310.410004  308.760010  40388466.0

              Adj Close
 Date
 2017-02-02   58.734081
 2017-02-03   59.208275
 2017-02-06   59.171078
 2017-02-07   58.975826
 2017-02-08   58.892147
 ...                ...
 2022-01-26  296.709991
 2022-01-27  299.839996
 2022-01-28  308.260010
 2022-01-31  310.980011
 2022-02-01  308.760010

 [1259 rows x 6 columns],
 'GOOG':                    High          Low         Open        Close   Volume  \
 Date
 2017-02-02   802.700012   792.000000   793.799988   798.530029  1532100
 2017-02-03   806.000000   800.369995   802.989990   801.489990  1463400
 2017-02-06   801.669983   795.250000   799.700012   801.340027  1184500
 2017-02-07   810.500000   801.780029   803.989990   806.969971  1241200
 2017-02-08   811.840027   803.190002   807.000000   808.380005  1155300
 ...                 ...          ...          ...          ...      ...
 2022-01-26  2656.149902  2543.070068  2611.850098  2584.800049  1981500
 2022-01-27  2652.198975  2578.899902  2627.219971  2582.419922  1512400
 2022-01-28  2667.409912  2573.889893  2600.000000  2665.790039  1525900
 2022-01-31  2716.870117  2645.479980  2683.959961  2713.969971  1702800
 2022-02-01  2764.000000  2692.000000  2756.699951  2757.570068  2166817

               Adj Close
 Date
 2017-02-02   798.530029
 2017-02-03   801.489990
 2017-02-06   801.340027
 2017-02-07   806.969971
 2017-02-08   808.380005
 ...                 ...
 2022-01-26  2584.800049
 2022-01-27  2582.419922
 2022-01-28  2665.790039
 2022-01-31  2713.969971
 2022-02-01  2757.570068

 [1259 rows x 6 columns]}

18. From above table Make two data frames: One for "Adj Close" for each brand, and other for "Volume" for each brand

In [38]:
price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                        for ticker, data in all_data.items()})

print(price,"\n")
print(volume)

                  AAPL         IBM        MSFT         GOOG
Date
2017-02-02   30.245739  132.696701   58.734081   798.530029
2017-02-03   30.375162  133.639221   59.208275   801.489990
2017-02-06   30.659901  133.669617   59.171078   801.340027
2017-02-07   30.951696  135.645874   58.975826   806.969971
2017-02-08   31.071707  134.964035   58.892147   808.380005
...                ...         ...         ...          ...
2022-01-26  159.690002  134.259995  296.709991  2584.800049
2022-01-27  159.220001  132.520004  299.839996  2582.419922
2022-01-28  170.330002  134.500000  308.260010  2665.790039
2022-01-31  174.779999  133.570007  310.980011  2713.969971
2022-02-01  174.610001  135.529999  308.760010  2757.570068

[1259 rows x 4 columns]

                   AAPL        IBM        MSFT     GOOG
Date
2017-02-02  134841600.0  2741043.0  45827000.0  1532100
2017-02-03   98029200.0  3461528.0  30301800.0  1463400
2017-02-06  107383600.0  2772737.0  19796400.0  1184500
2017-02-07  152735200.0  4051681.0  20277200.0  1241200
2017-02-08   92016400.0  3047103.0  18096400.0  1155300
...                 ...        ...         ...      ...
2022-01-26  108275300.0  8336000.0  90428900.0  1981500
2022-01-27  121954600.0  5497300.0  53481300.0  1512400
2022-01-28  179935700.0  5471500.0  49743700.0  1525900
2022-01-31  115541600.0  5859000.0  46444500.0  1702800
2022-02-01   79067749.0  5991906.0  40388466.0  2166817

[1259 rows x 4 columns]

19. We can observe that values are changing for each day in Price data set. Can we see the perecent change row wise?

In [39]:
returns = price.pct_change()
returns
#.pct_change is time series function to see row wise percent change

                AAPL       IBM      MSFT      GOOG
Date
2017-02-02       NaN       NaN       NaN       NaN
2017-02-03  0.004279  0.007103  0.008074  0.003707
2017-02-06  0.009374  0.000227 -0.000628 -0.000187
2017-02-07  0.009517  0.014785 -0.003300  0.007026
2017-02-08  0.003877 -0.005027 -0.001419  0.001747
...              ...       ...       ...       ...
2022-01-26 -0.000563 -0.013520  0.028493  0.019762
2022-01-27 -0.002943 -0.012960  0.010549 -0.000921
2022-01-28  0.069778  0.014941  0.028082  0.032284
2022-01-31  0.026126 -0.006914  0.008824  0.018073
2022-02-01 -0.000973  0.014674 -0.007139  0.016065

[1259 rows x 4 columns]

20. Find the correlation between "MSFT" AND "IBM" brand in returns column

In [40]:
returns['MSFT'].corr(returns['IBM'])

0.4842342190456027

21. Find the covariance and covariance between "MSFT" AND "IBM" brand in returns column

In [41]:
returns['MSFT'].cov(returns['IBM'])

0.00014101794163840642

22. Find the correlation among all columns in a data frame

In [42]:
print(returns['MSFT'].cov(returns['IBM']),"\n"*2)

print(returns.cov())

0.00014101794163840642


          AAPL       IBM      MSFT      GOOG
AAPL  0.000372  0.000138  0.000250  0.000220
IBM   0.000138  0.000278  0.000141  0.000131
MSFT  0.000250  0.000141  0.000305  0.000234
GOOG  0.000220  0.000131  0.000234  0.000294

23. Find the correlation between same columns in two different datasets. Take returns and volume here

In [44]:
returns.corrwith(volume)

AAPL   -0.084230
IBM    -0.129080
MSFT   -0.068377
GOOG   -0.108565
dtype: float64

24. Find summary of all numerical column in a dataset

In [52]:
returns.describe()

              AAPL          IBM         MSFT         GOOG
count  1258.000000  1258.000000  1258.000000  1258.000000
mean      0.001581     0.000157     0.001473     0.001132
std       0.019290     0.016677     0.017463     0.017133
min      -0.128647    -0.128508    -0.147390    -0.111008
25%      -0.006673    -0.006451    -0.005772    -0.005838
50%       0.001242     0.000473     0.001429     0.001516
75%       0.011074     0.007178     0.010032     0.009270
max       0.119808     0.113010     0.142169     0.104485

25. Find information of entire dataset

In [54]:
returns.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1259 entries, 2017-02-02 to 2022-02-01
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    1258 non-null   float64
 1   IBM     1258 non-null   float64
 2   MSFT    1258 non-null   float64
 3   GOOG    1258 non-null   float64
dtypes: float64(4)
memory usage: 49.2 KB